app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    # redirects when artist not found
    if params[:artist_id]
      if Artist.find(params[:artist_id])
        @songs = Artist.find(params[:artist_id]).songs
      else
        redirect_to artist_path, alert: "Artist not found."
      end
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # redirects to artists songs when aartist song not found
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      @song = Song.find_by(id: params[:id])